src/cf/DataProcessors/НастройкиПлатежныхСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>НастройкиПлатежныхСистем</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/ШаблоныНазначенийПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ШаблоныНазначенийПлатежей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>140</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиПодключенияКСистемеБыстрыхПлатежей</v8:Type>
						<v8:Type>cfg:CatalogRef.НастройкиПодключенияКИнтернетЭквайрингу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СценарийСБП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/НастройкиПлатежныхСистем/Forms/ФормаНастройкиНазначенияПлатежа/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.НастройкаПодключения) Тогда
		Отказ = Истина;
		ВызватьИсключение НСтр("ru = 'Некорректные параметры формы.'");
	КонецЕсли;
	
	НастройкаПодключения = Параметры.НастройкаПодключения;
	
	ОпределитьПодсистему(Отказ);
	
	Если Отказ Тогда
		ВызватьИсключение НСтр("ru = 'Некорректные параметры формы.'");
	КонецЕсли;
		
	УстановитьУсловноеОформление();
	
	ИдентификаторыКоманд = Новый Структура;
	ИдентификаторыКоманд.Вставить("ИдентификаторовПараметров", Новый Соответствие);
	ИдентификаторыКоманд.Вставить("ПараметрыИдентификаторов", Новый Соответствие);
	
	СохраненныеШаблоны = РегистрыСведений.ШаблоныНазначенийПлатежей.ШаблоныНазначенийПлатежей(
		НастройкаПодключения);
	
	ПредопределенныеШаблоны = Неопределено;

	Если ЭтоСБП Тогда
		МодульСистемаБыстрыхПлатежейСобытия   = ОбщегоНазначения.ОбщийМодуль("СистемаБыстрыхПлатежейСобытия");
		МодульСистемаБыстрыхПлатежейСлужебный = ОбщегоНазначения.ОбщийМодуль("СистемаБыстрыхПлатежейСлужебный");
		МодульСистемаБыстрыхПлатежейСобытия.ПриОпределенииШаблоновНазначений(
			ВариантНастройки,
			МодульСистемаБыстрыхПлатежейСлужебный.НастройкиПодключенияПрограммы(),
			ПредопределенныеШаблоны);
	ИначеЕсли ЭтоЭквайринг Тогда
		МодульИнтернетЭквайрингСлужебный = ОбщегоНазначения.ОбщийМодуль("ИнтернетЭквайрингСлужебный");
		ПредопределенныеШаблоны = МодульИнтернетЭквайрингСлужебный.ПрикладныеНастройкиПодключения().ШаблоныНазначений
	КонецЕсли;
	
	Счетчик = 0;
	Для Каждого ДанныеШаблона Из ПредопределенныеШаблоны Цикл
		
		НовыйШаблон = НастройкиШаблонов.Добавить();
		ЗаполнитьЗначенияСвойств(
			НовыйШаблон,
			ДанныеШаблона,
			"ОбъектМетаданных, Идентификатор, Наименование");
		НовыйШаблон.НазначениеПлатежа = СохраненныеШаблоны.Получить(
			ДанныеШаблона.Идентификатор);
		НовыйШаблон.Параметры.ЗагрузитьЗначения(
			ДанныеШаблона.Параметры);
		
		Для Каждого ДанныеПараметра Из ДанныеШаблона.Параметры Цикл
			
			ИдентификаторКоманды = "Параметр" + Счетчик;
			ИдентификаторыКоманд.ИдентификаторовПараметров.Вставить(
				ДанныеШаблона.Идентификатор + "_" + ДанныеПараметра.Идентификатор,
				ИдентификаторКоманды);
			ИдентификаторыКоманд.ПараметрыИдентификаторов.Вставить(
				ИдентификаторКоманды,
				ДанныеПараметра.Идентификатор);
			
			КомандаВставкиПараметра = Команды.Добавить(
				ИдентификаторКоманды);
			КомандаВставкиПараметра.Заголовок = ДанныеПараметра.Наименование;
			КомандаВставкиПараметра.Действие = "Подключаемый_ПриОбработкеВставкиПараметра";
			
			КнопкаВставкиПараметра = Элементы.Добавить(
				ИдентификаторКоманды,
				Тип("КнопкаФормы"),
				Элементы.ДобавитьВШаблон);
			КнопкаВставкиПараметра.Заголовок = ДанныеПараметра.Наименование;
			КнопкаВставкиПараметра.ИмяКоманды = ИдентификаторКоманды;
			
			Счетчик = Счетчик + 1;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если НастройкиШаблонов.Количество() = 0 Тогда
		Отказ = Истина;
		ВызватьИсключение НСтр("ru = 'Нет доступных для настройки шаблонов.'");
	ИначеЕсли НастройкиШаблонов.Количество() = 1 Тогда
		Элементы.ГруппаЛеваяКолонка.Видимость = Ложь;
		Элементы.ДекорацияПредставлениеШаблонаНазначения.Видимость = Истина;
		Элементы.ДекорацияПредставлениеШаблонаНазначения.Заголовок =
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Назначение шаблона: %1'"),
				НастройкиШаблонов[0].Наименование);
	Иначе
		Элементы.ГруппаЛеваяКолонка.Видимость = Истина;
		Элементы.ДекорацияПредставлениеШаблонаНазначения.Видимость = Ложь;
	КонецЕсли;
	
	ТекущийИдентификатор = НастройкиШаблонов[0].Идентификатор;
	
	ГраницыВыделения = Новый Структура;
	ГраницыВыделения.Вставить("НачалоСтроки", 0);
	ГраницыВыделения.Вставить("НачалоКолонки", 0);
	ГраницыВыделения.Вставить("КонецСтроки", 0);
	ГраницыВыделения.Вставить("КонецКолонки", 0);
	ГраницыВыделения.Вставить("ТребуетсяОбновление", Ложь);
	
	ИзменениеШаблоновДоступно = ИзменениеШаблоновДоступно();
	
	Элементы.Сохранить.Видимость = ИзменениеШаблоновДоступно;
	Элементы.ДобавитьВШаблон.Видимость = ИзменениеШаблоновДоступно;
	Элементы.ШаблонНазначения.Доступность = ИзменениеШаблоновДоступно;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НастройкиШаблонов.Количество() = 1 Тогда
		ПриСменеНастройкиШаблонов(0);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ШаблонНазначенияОкончаниеВводаТекста(
		Элемент,
		Текст,
		ДанныеВыбора,
		ПараметрыПолученияДанных,
		СтандартнаяОбработка)
	
	ГраницыВыделения.ТребуетсяОбновление = Истина;
	
	Отказ = Ложь;
	
	ПроверитьЗапрещенныеСимволы(Текст, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Идентификатор", ТекущийИдентификатор);
	НайденныеШаблоны = НастройкиШаблонов.НайтиСтроки(Отбор);
	Если НайденныеШаблоны.Количество() <> 0 И ОбновитьНазначение Тогда
		НайденныеШаблоны[0].НазначениеПлатежа = Текст;
	КонецЕсли;
	
	ТекущееНазначениеПлатежа = Текст;
	ОбновитьНазначение = Истина;
	
	ГраницыВыделения.ТребуетсяОбновление = Ложь;
	Элементы.ШаблонНазначения.ПолучитьГраницыВыделения(
		ГраницыВыделения.НачалоСтроки,
		ГраницыВыделения.НачалоКолонки,
		ГраницыВыделения.КонецСтроки,
		ГраницыВыделения.КонецКолонки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиШаблонов

&НаКлиенте
Процедура НастройкиШаблоновПриАктивизацииСтроки(Элемент)
	
	ПриСменеНастройкиШаблонов(Элементы.НастройкиШаблонов.ТекущаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Идентификатор", ТекущийИдентификатор);
	НайденныеШаблоны = НастройкиШаблонов.НайтиСтроки(Отбор);
	Если НайденныеШаблоны.Количество() <> 0 И ОбновитьНазначение Тогда
		НайденныеШаблоны[0].НазначениеПлатежа = ТекущееНазначениеПлатежа;
	КонецЕсли;
	
	Отказ = Ложь;
	КоличествоЗаполненных = 0;
	Для Каждого ДанныеШаблона Из НастройкиШаблонов Цикл
		
		Если Не ЗначениеЗаполнено(ДанныеШаблона.НазначениеПлатежа) Тогда
			Продолжить;
		КонецЕсли;
		КоличествоЗаполненных = КоличествоЗаполненных + 1;
		
		ПроверитьЗапрещенныеСимволы(ДанныеШаблона.НазначениеПлатежа, Отказ);
	
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНаСервере(
		НастройкаПодключения,
		НастройкиШаблонов,
		ВариантНастройки);
	
	Закрыть(КоличествоЗаполненных);
	
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ПриОбработкеВставкиПараметра(Команда)
	
	Если НастройкиШаблонов.Количество() > 1
		И Элементы.НастройкиШаблонов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ГраницыВыделения.ТребуетсяОбновление Тогда
		Элементы.ШаблонНазначения.ПолучитьГраницыВыделения(
			ГраницыВыделения.НачалоСтроки,
			ГраницыВыделения.НачалоКолонки,
			ГраницыВыделения.КонецСтроки,
			ГраницыВыделения.КонецКолонки);
	КонецЕсли;
	ГраницыВыделения.ТребуетсяОбновление = Истина;
	
	Если (ГраницыВыделения.КонецКолонки = ГраницыВыделения.НачалоКолонки
		И ГраницыВыделения.НачалоСтроки = ГраницыВыделения.КонецСтроки
		И ГраницыВыделения.КонецКолонки = (СтрДлина(ТекущееНазначениеПлатежа) + 1))
		Или Не ЗначениеЗаполнено(ТекущееНазначениеПлатежа) Тогда
		ТекущееНазначениеПлатежа = ТекущееНазначениеПлатежа
			+ ИдентификаторыКоманд.ПараметрыИдентификаторов.Получить(Команда.Имя);
		Возврат;
	КонецЕсли;
	
	НомерСтроки = ГраницыВыделения.КонецСтроки - ГраницыВыделения.НачалоСтроки + 1;
	СчетчикСимволов = 1;
	СчетчикСтрок = 1;
	СчетчикКолонок = 0;
	Результат = "";
	
	Пока СчетчикСимволов <= СтрДлина(ТекущееНазначениеПлатежа) Цикл
		
		ТекущийСимвол = Сред(
			ТекущееНазначениеПлатежа,
			СчетчикСимволов,
			1);
		
		Если ТекущийСимвол = Символы.ПС Тогда
			СчетчикСтрок = СчетчикСтрок + 1;
			СчетчикКолонок = 0;
		КонецЕсли;
		
		СчетчикКолонок = СчетчикКолонок + 1;
		СчетчикСимволов = СчетчикСимволов + 1;
		
		Если НомерСтроки = СчетчикСтрок
			И ГраницыВыделения.НачалоКолонки = СчетчикКолонок Тогда
			
			Результат = Результат + ИдентификаторыКоманд.ПараметрыИдентификаторов.Получить(Команда.Имя);
			Если ГраницыВыделения.НачалоКолонки <> ГраницыВыделения.КонецКолонки Тогда
				СчетчикСимволов = СчетчикСимволов + ГраницыВыделения.КонецКолонки - ГраницыВыделения.НачалоКолонки - 1;
				Продолжить;
			КонецЕсли;
			
		ИначеЕсли ГраницыВыделения.НачалоКолонки = СчетчикКолонок
			И ГраницыВыделения.НачалоСтроки = СчетчикСтрок
			И ГраницыВыделения.КонецСтроки <> ГраницыВыделения.НачалоСтроки Тогда
			
			Результат = Результат + ИдентификаторыКоманд.ПараметрыИдентификаторов.Получить(Команда.Имя);
			Пока СчетчикСимволов <= СтрДлина(ТекущееНазначениеПлатежа) Цикл
				
				СчетчикСимволов = СчетчикСимволов + 1;
				СчетчикКолонок = СчетчикКолонок + 1;
				
				ТекущийСимвол = Сред(
					ТекущееНазначениеПлатежа,
					СчетчикСимволов,
					1);
				
				Если ГраницыВыделения.КонецСтроки = СчетчикСтрок
					И СчетчикКолонок = ГраницыВыделения.КонецКолонки Тогда
					Прервать;
				КонецЕсли;
				
				Если ТекущийСимвол = Символы.ПС Тогда
					СчетчикСтрок = СчетчикСтрок + 1;
					СчетчикКолонок = 0;
				КонецЕсли;
				
			КонецЦикла;
			
			Продолжить;
			
		КонецЕсли;
		
		Результат = Результат + ТекущийСимвол;
		
	КонецЦикла;
	
	ТекущееНазначениеПлатежа = Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриСменеНастройкиШаблонов(ИдентификаторСтроки)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Идентификатор", ТекущийИдентификатор);
	
	НайденныеШаблоны = НастройкиШаблонов.НайтиСтроки(Отбор);
	Если НайденныеШаблоны.Количество() <> 0 И ОбновитьНазначение Тогда
		НайденныеШаблоны[0].НазначениеПлатежа = ТекущееНазначениеПлатежа;
	КонецЕсли;
	ОбновитьНазначение = Истина;
	
	ТекущаяСтрока = НастройкиШаблонов.НайтиПоИдентификатору(ИдентификаторСтроки);
	ТекущееНазначениеПлатежа = ТекущаяСтрока.НазначениеПлатежа;
	ТекущийИдентификатор = ТекущаяСтрока.Идентификатор;
	
	Для Каждого КомандаВставки Из Элементы.ДобавитьВШаблон.ПодчиненныеЭлементы Цикл
		КомандаВставки.Видимость = Ложь;
	КонецЦикла;
	
	Для Каждого ДанныеПараметра Из ТекущаяСтрока.Параметры Цикл
		ИмяКоманды = ИдентификаторыКоманд.ИдентификаторовПараметров.Получить(
			ТекущийИдентификатор + "_" + ДанныеПараметра.Значение.Идентификатор);
		Элементы[ИмяКоманды].Видимость = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкиШаблонов.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкиШаблоновНаименование.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НастройкиШаблонов.НазначениеПлатежа");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра(
		"Шрифт",
		Метаданные.ЭлементыСтиля.ШрифтВажногоЗаголовкаБИП.Значение);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНаСервере(
		Знач НастройкаПодключения,
		Знач НастройкиШаблонов,
		Знач ВариантНастройки)
	
	УстановитьПривилегированныйРежим(Истина);
	РегистрыСведений.ШаблоныНазначенийПлатежей.ОбновитьШаблоныНазначений(
		НастройкаПодключения,
		НастройкиШаблонов,
		ВариантНастройки);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗапрещенныеСимволы(ПроверяемыйТекст, Отказ)
	
	ЗапрещенныеСимволы = НастройкиПлатежныхСистемКлиентСервер.ЗапрещенныеСимволыНазначенияПлатежа(
			ПроверяемыйТекст);
	
	Если ЗапрещенныеСимволы.Количество() <> 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В назначении платежа присутствуют запрещенные символы: %1'"),
				СтрСоединить(ЗапрещенныеСимволы, ",")),
			,
			,
			"ТекущееНазначениеПлатежа",
			Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьПодсистему(Отказ)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СистемаБыстрыхПлатежей.БазоваяФункциональностьСБП") Тогда
		МодульСистемаБыстрыхПлатежейСлужебный = ОбщегоНазначения.ОбщийМодуль("СистемаБыстрыхПлатежейСлужебный");
		Если МодульСистемаБыстрыхПлатежейСлужебный.ЭтоНастройкаПодключения(НастройкаПодключения) Тогда
			
			ЭтоСБП           = Истина;
			ВариантНастройки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				НастройкаПодключения,
				"ВариантНастройки");
			Возврат;
			
		КонецЕсли;
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ИнтернетЭквайринг") Тогда
		МодульИнтернетЭквайрингСлужебный = ОбщегоНазначения.ОбщийМодуль("ИнтернетЭквайрингСлужебный");
		Если МодульИнтернетЭквайрингСлужебный.ЭтоНастройкаПодключения(НастройкаПодключения) Тогда
			
			ЭтоЭквайринг     = Истина;
			ВариантНастройки = Неопределено;
			Возврат;
			
		КонецЕсли;
	КонецЕсли;

	Отказ = Истина;
	
КонецПроцедуры

&НаСервере
Функция ИзменениеШаблоновДоступно()
	
	Если ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ШаблоныНазначенийПлатежей) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЭтоСБП Тогда
		МодульСистемаБыстрыхПлатежей = ОбщегоНазначения.ОбщийМодуль("СистемаБыстрыхПлатежей");
		Возврат МодульСистемаБыстрыхПлатежей.НастройкаПодключенияДоступна();
	КонецЕсли;

	Если ЭтоЭквайринг Тогда
		МодульИнтернетЭквайринг = ОбщегоНазначения.ОбщийМодуль("ИнтернетЭквайринг");
		Возврат МодульИнтернетЭквайринг.НастройкаПодключенияДоступна();
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
